cjacker/opensource-toolchain-8051/headers/stc12h.h
__sfr __at (0xdc) USBCLK;
__sfr __at (0xec) USBDAT;
__sfr __at (0xf4) USBCON;
__sfr __at (0xfc) USBADR;

//如下特殊功能寄存器位于扩展RAM区域
//访问这些寄存器,需先将P_SW2的BIT7设置为1,才可正常读写
#define CCAPM3 (*(unsigned char volatile __xdata *)0xfd54)
#define CCAP3L (*(unsigned char volatile __xdata *)0xfd55)
#define CCAP3H (*(unsigned char volatile __xdata *)0xfd56)
#define PCA_PWM3 (*(unsigned char volatile __xdata *)0xfd57)

#define CKSEL (*(unsigned char volatile __xdata *)0xfe00)
#define MCK_IRC24M 0x00
#define MCK_XOSC 0x01
#define MCK_IRC32K 0x03
#define CLKDIV (*(unsigned char volatile __xdata *)0xfe01)
#define IRC24MCR (*(unsigned char volatile __xdata *)0xfe02)
#define ENIRC24M 0x80
#define IRC24MST 0x01
#define XOSCCR (*(unsigned char volatile __xdata *)0xfe03)
#define ENXOSC 0x80
#define XITYPE 0x40
#define XOSCST 0x01
#define IRC32KCR (*(unsigned char volatile __xdata *)0xfe04)
#define ENIRC32K 0x80
#define IRC32KST 0x01
#define MCLKOCR (*(unsigned char volatile __xdata *)0xfe05)
#define MCLKO_S 0x80
#define IRC48MCR (*(unsigned char volatile __xdata *)0xfe07)
#define P0PU (*(unsigned char volatile __xdata *)0xfe10)
#define P1PU (*(unsigned char volatile __xdata *)0xfe11)
#define P2PU (*(unsigned char volatile __xdata *)0xfe12)
#define P3PU (*(unsigned char volatile __xdata *)0xfe13)
#define P4PU (*(unsigned char volatile __xdata *)0xfe14)
#define P5PU (*(unsigned char volatile __xdata *)0xfe15)
#define P6PU (*(unsigned char volatile __xdata *)0xfe16)
#define P7PU (*(unsigned char volatile __xdata *)0xfe17)
#define P0NCS (*(unsigned char volatile __xdata *)0xfe18)
#define P1NCS (*(unsigned char volatile __xdata *)0xfe19)
#define P2NCS (*(unsigned char volatile __xdata *)0xfe1a)
#define P3NCS (*(unsigned char volatile __xdata *)0xfe1b)
#define P4NCS (*(unsigned char volatile __xdata *)0xfe1c)
#define P5NCS (*(unsigned char volatile __xdata *)0xfe1d)
#define P6NCS (*(unsigned char volatile __xdata *)0xfe1e)
#define P7NCS (*(unsigned char volatile __xdata *)0xfe1f)
#define P0SR (*(unsigned char volatile __xdata *)0xfe20)
#define P1SR (*(unsigned char volatile __xdata *)0xfe21)
#define P2SR (*(unsigned char volatile __xdata *)0xfe22)
#define P3SR (*(unsigned char volatile __xdata *)0xfe23)
#define P4SR (*(unsigned char volatile __xdata *)0xfe24)
#define P5SR (*(unsigned char volatile __xdata *)0xfe25)
#define P6SR (*(unsigned char volatile __xdata *)0xfe26)
#define P7SR (*(unsigned char volatile __xdata *)0xfe27)
#define P0DR (*(unsigned char volatile __xdata *)0xfe28)
#define P1DR (*(unsigned char volatile __xdata *)0xfe29)
#define P2DR (*(unsigned char volatile __xdata *)0xfe2a)
#define P3DR (*(unsigned char volatile __xdata *)0xfe2b)
#define P4DR (*(unsigned char volatile __xdata *)0xfe2c)
#define P5DR (*(unsigned char volatile __xdata *)0xfe2d)
#define P6DR (*(unsigned char volatile __xdata *)0xfe2e)
#define P7DR (*(unsigned char volatile __xdata *)0xfe2f)
#define P0IE (*(unsigned char volatile __xdata *)0xfe30)
#define P1IE (*(unsigned char volatile __xdata *)0xfe31)
#define P2IE (*(unsigned char volatile __xdata *)0xfe32)
#define P3IE (*(unsigned char volatile __xdata *)0xfe33)
#define P4IE (*(unsigned char volatile __xdata *)0xfe34)
#define P5IE (*(unsigned char volatile __xdata *)0xfe35)
#define P6IE (*(unsigned char volatile __xdata *)0xfe36)
#define P7IE (*(unsigned char volatile __xdata *)0xfe37)
#define I2CCFG (*(unsigned char volatile __xdata *)0xfe80)
#define ENI2C 0x80
#define I2CMASTER 0x40
#define I2CSLAVE 0x00
#define I2CMSCR (*(unsigned char volatile __xdata *)0xfe81)
#define EMSI 0x80
#define MS_IDLE 0x00
#define MS_START 0x01
#define MS_SENDDAT 0x02
#define MS_RECVACK 0x03
#define MS_RECVDAT 0x04
#define MS_SENDACK 0x05
#define MS_STOP 0x06
#define MS_START_SENDDAT_RECVACK 0x09
#define MS_SENDDAT_RECVACK 0x0a
#define MS_RECVDAT_SENDACK 0x0b
#define MS_RECVDAT_SENDNAK 0x0c
#define I2CMSST (*(unsigned char volatile __xdata *)0xfe82)
#define MSBUSY 0x80
#define MSIF 0x40
#define MSACKI 0x02
#define MSACKO 0x01
#define I2CSLCR (*(unsigned char volatile __xdata *)0xfe83)
#define ESTAI 0x40
#define ERXI 0x20
#define ETXI 0x10
#define ESTOI 0x08
#define SLRST 0x01
#define I2CSLST (*(unsigned char volatile __xdata *)0xfe84)
#define SLBUSY 0x80
#define STAIF 0x40
#define RXIF 0x20
#define TXIF 0x10
#define STOIF 0x08
#define TXING 0x04
#define SLACKI 0x02
#define SLACKO 0x01
#define I2CSLADR (*(unsigned char volatile __xdata *)0xfe85)
#define I2CTXD (*(unsigned char volatile __xdata *)0xfe86)
#define I2CRXD (*(unsigned char volatile __xdata *)0xfe87)
#define I2CMSAUX (*(unsigned char volatile __xdata *)0xfe88)
#define WDTA 0x01
#define TM2PS (*(unsigned char volatile __xdata *)0xfea2)
#define TM3PS (*(unsigned char volatile __xdata *)0xfea3)
#define TM4PS (*(unsigned char volatile __xdata *)0xfea4)
#define ADCTIM (*(unsigned char volatile __xdata *)0xfea8)
#define T3T4PIN (*(unsigned char volatile __xdata *)0xfeac)
#define PWM1_ETRPS (*(unsigned char volatile __xdata *)0xfeb0)
#define PWM1_BRK_S1 0x00
#define PWM1_BRK_S2 0x04
#define PWM1_ETR_S1 0x00
#define PWM1_ETR_S2 0x01
#define PWM1_ETR_S3 0x02
#define PWM1_ETR_S4 0x03
#define PWM1_ENO (*(unsigned char volatile __xdata *)0xfeb1)
#define PWM1_ENO4N 0x80
#define PWM1_ENO4P 0x40
#define PWM1_ENO3N 0x20
#define PWM1_ENO3P 0x10
#define PWM1_ENO2N 0x08
#define PWM1_ENO2P 0x04
#define PWM1_ENO1N 0x02
#define PWM1_ENO1P 0x01
#define PWM1_PS (*(unsigned char volatile __xdata *)0xfeb2)
#define PWM1_C4_S1 0x00
#define PWM1_C4_S2 0x40
#define PWM1_C4_S3 0x80
#define PWM1_C4_S4 0xc0
#define PWM1_C3_S1 0x00
#define PWM1_C3_S2 0x10
#define PWM1_C3_S3 0x20
#define PWM1_C3_S4 0x30
#define PWM1_C2_S1 0x00
#define PWM1_C2_S2 0x04
#define PWM1_C2_S3 0x08
#define PWM1_C2_S4 0x0c
#define PWM1_C1_S1 0x00
#define PWM1_C1_S2 0x01
#define PWM1_C1_S3 0x02
#define PWM1_C1_S4 0x03
#define PWM1_IOAUX (*(unsigned char volatile __xdata *)0xfeb3)
#define PWM1_AUX4N 0x80
#define PWM1_AUX4P 0x40
#define PWM1_AUX3N 0x20
#define PWM1_AUX3P 0x10
#define PWM1_AUX2N 0x08
#define PWM1_AUX2P 0x04
#define PWM1_AUX1N 0x02
#define PWM1_AUX1P 0x01
#define PWM2_ETRPS (*(unsigned char volatile __xdata *)0xfeb4)
#define PWm2_BRK_S1 0x00
#define PWm2_BRK_S2 0x04
#define PWm2_ETR_S1 0x00
#define PWm2_ETR_S2 0x01
#define PWm2_ETR_S3 0x02
#define PWm2_ETR_S4 0x03
#define PWM2_ENO (*(unsigned char volatile __xdata *)0xfeb5)
#define PWM2_ENO8P 0x40
#define PWM2_ENO7P 0x10
#define PWM2_ENO6P 0x04
#define PWM2_ENO5P 0x01
#define PWM2_PS (*(unsigned char volatile __xdata *)0xfeb6)
#define PWM2_C8_S1 0x00
#define PWM2_C8_S2 0x40
#define PWM2_C8_S3 0x80
#define PWM2_C8_S4 0xc0
#define PWM2_C7_S1 0x00
#define PWM2_C7_S2 0x10
#define PWM2_C7_S3 0x20
#define PWM2_C7_S4 0x30
#define PWM2_C6_S1 0x00
#define PWM2_C6_S2 0x04
#define PWM2_C6_S3 0x08
#define PWM2_C6_S4 0x0c
#define PWM2_C5_S1 0x00
#define PWM2_C5_S2 0x01
#define PWM2_C5_S3 0x02
#define PWM2_C5_S4 0x03
#define PWM2_IOAUX (*(unsigned char volatile __xdata *)0xfeb7)
#define PWM2_AUX8P 0x40
#define PWM2_AUX7P 0x10
#define PWM2_AUX6P 0x04
#define PWM2_AUX5P 0x01
#define PWM1_CR1 (*(unsigned char volatile __xdata *)0xfec0)
#define PWM1_ARPE 0x80
#define PWM1_CMS0 0x00
#define PWM1_CMS1 0x20
#define PWM1_CMS2 0x40
#define PWM1_CMS3 0x60
#define PWM1_UP 0x00
#define PWM1_DOWN 0x10
#define PWM1_OPM 0x08
#define PWM1_URS 0x04
#define PWM1_UDIS 0x02
#define PWM1_CEN 0x01
#define PWM1_CR2 (*(unsigned char volatile __xdata *)0xfec1)
#define PWM1_TI1S 0x80
#define PWM1_MMS0 0x00
#define PWM1_MMS1 0x10
#define PWM1_MMS2 0x20
#define PWM1_MMS3 0x30
#define PWM1_MMS4 0x40
#define PWM1_MMS5 0x50
#define PWM1_MMS6 0x60
#define PWM1_MMS7 0x70
#define PWM1_COMS 0x04
#define PWM1_CCPS 0x01
#define PWM1_SMCR (*(unsigned char volatile __xdata *)0xfec2)
#define PWM1_MSM 0x80
#define PWM1_TS0 0x00
#define PWM1_TS1 0x10
#define PWM1_TS2 0x20
#define PWM1_TS3 0x30
#define PWM1_TS4 0x40
#define PWM1_TS5 0x50
#define PWM1_TS6 0x60
#define PWM1_TS7 0x70
#define PWM1_SMS0 0x00
#define PWM1_SMS1 0x01
#define PWM1_SMS2 0x02
#define PWM1_SMS3 0x03
#define PWM1_SMS4 0x04
#define PWM1_SMS5 0x05
#define PWM1_SMS6 0x06
#define PWM1_SMS7 0x07
#define PWM1_ETR (*(unsigned char volatile __xdata *)0xfec3)
#define PWM1_ETP 0x80
#define PWM1_ECE 0x40
#define PWM1_ETPS0 0x00
#define PWM1_ETPS1 0x10
#define PWM1_ETPS2 0x20
#define PWM1_ETPS3 0x30
#define PWM1_IER (*(unsigned char volatile __xdata *)0xfec4)
#define PWM1_BIE 0x80
#define PWM1_TIE 0x40
#define PWM1_COMIE 0x20
#define PWM1_CC4IE 0x10
#define PWM1_CC3IE 0x08
#define PWM1_CC2IE 0x04
#define PWM1_CC1IE 0x02
#define PWM1_UIE 0x01
#define PWM1_SR1 (*(unsigned char volatile __xdata *)0xfec5)
#define PWM1_BIF 0x80
#define PWM1_TIF 0x40
#define PWM1_COMIF 0x20
#define PWM1_CC4IF 0x10
#define PWM1_CC3IF 0x08
#define PWM1_CC2IF 0x04
#define PWM1_CC1IF 0x02
#define PWM1_UIF 0x01
#define PWM1_SR2 (*(unsigned char volatile __xdata *)0xfec6)
#define PWM1_CC4OF 0x10
#define PWM1_CC3OF 0x08
#define PWM1_CC2OF 0x04
#define PWM1_CC1OF 0x02
#define PWM1_EGR (*(unsigned char volatile __xdata *)0xfec7)
#define PWM1_BG 0x80
#define PWM1_TG 0x40
#define PWM1_COMG 0x20
#define PWM1_CC4G 0x10
#define PWM1_CC3G 0x08
#define PWM1_CC2G 0x04
#define PWM1_CC1G 0x02
#define PWM1_UG 0x01
#define PWM1_CCMR1 (*(unsigned char volatile __xdata *)0xfec8)
#define PWM1_OC1CE 0x80
#define PWM1_OC1M0 0x00
#define PWM1_OC1M1 0x10
#define PWM1_OC1M2 0x20
#define PWM1_OC1M3 0x30
#define PWM1_OC1M4 0x40
#define PWM1_OC1M5 0x50
#define PWM1_OC1M6 0x60
#define PWM1_OC1M7 0x70
#define PWM1_OC1PE 0x08
#define PWM1_OC1FE 0x04
#define PWM1_CC1S0 0x00
#define PWM1_CC1S1 0x01
#define PWM1_CC1S2 0x02
#define PWM1_CC1S3 0x03
#define PWM1_IC1F0 0x00
#define PWM1_IC1F1 0x01
#define PWM1_IC1F2 0x02
#define PWM1_IC1F3 0x03
#define PWM1_IC1F4 0x04
#define PWM1_IC1F5 0x05
#define PWM1_IC1F6 0x06
#define PWM1_IC1F7 0x07
#define PWM1_IC1F8 0x08
#define PWM1_IC1F9 0x09
#define PWM1_IC1F10 0x0a
#define PWM1_IC1F11 0x0b
#define PWM1_IC1F12 0x0c
#define PWM1_IC1F13 0x0d
#define PWM1_IC1F14 0x0e
#define PWM1_IC1F15 0x0f
#define PWM1_CCMR2 (*(unsigned char volatile __xdata *)0xfec9)
#define PWM1_OC2CE 0x80
#define PWM1_OC2M0 0x00
#define PWM1_OC2M1 0x10
#define PWM1_OC2M2 0x20
#define PWM1_OC2M3 0x30
#define PWM1_OC2M4 0x40
#define PWM1_OC2M5 0x50
#define PWM1_OC2M6 0x60
#define PWM1_OC2M7 0x70
#define PWM1_OC2PE 0x08
#define PWM1_OC2FE 0x04
#define PWM1_CC2S0 0x00
#define PWM1_CC2S1 0x01
#define PWM1_CC2S2 0x02
#define PWM1_CC2S3 0x03
#define PWM1_IC2F0 0x00
#define PWM1_IC2F1 0x01
#define PWM1_IC2F2 0x02
#define PWM1_IC2F3 0x03
#define PWM1_IC2F4 0x04
#define PWM1_IC2F5 0x05
#define PWM1_IC2F6 0x06
#define PWM1_IC2F7 0x07
#define PWM1_IC2F8 0x08
#define PWM1_IC2F9 0x09
#define PWM1_IC2F10 0x0a
#define PWM1_IC2F11 0x0b
#define PWM1_IC2F12 0x0c
#define PWM1_IC2F13 0x0d
#define PWM1_IC2F14 0x0e
#define PWM1_IC2F15 0x0f
#define PWM1_CCMR3 (*(unsigned char volatile __xdata *)0xfeca)
#define PWM1_OC3CE 0x80
#define PWM1_OC3M0 0x00
#define PWM1_OC3M1 0x10
#define PWM1_OC3M2 0x20
#define PWM1_OC3M3 0x30
#define PWM1_OC3M4 0x40
#define PWM1_OC3M5 0x50
#define PWM1_OC3M6 0x60
#define PWM1_OC3M7 0x70
#define PWM1_OC3PE 0x08
#define PWM1_OC3FE 0x04
#define PWM1_CC3S0 0x00
#define PWM1_CC3S1 0x01
#define PWM1_CC3S2 0x02
#define PWM1_CC3S3 0x03
#define PWM1_IC3F0 0x00
#define PWM1_IC3F1 0x01
#define PWM1_IC3F2 0x02
#define PWM1_IC3F3 0x03
#define PWM1_IC3F4 0x04
#define PWM1_IC3F5 0x05
#define PWM1_IC3F6 0x06
#define PWM1_IC3F7 0x07
#define PWM1_IC3F8 0x08
#define PWM1_IC3F9 0x09
#define PWM1_IC3F10 0x0a
#define PWM1_IC3F11 0x0b
#define PWM1_IC3F12 0x0c
#define PWM1_IC3F13 0x0d
#define PWM1_IC3F14 0x0e
#define PWM1_IC3F15 0x0f
#define PWM1_CCMR4 (*(unsigned char volatile __xdata *)0xfecb)
#define PWM1_OC4CE 0x80
#define PWM1_OC4M0 0x00
#define PWM1_OC4M1 0x10
#define PWM1_OC4M2 0x20
#define PWM1_OC4M3 0x30
#define PWM1_OC4M4 0x40
#define PWM1_OC4M5 0x50
#define PWM1_OC4M6 0x60
#define PWM1_OC4M7 0x70
#define PWM1_OC4PE 0x08
#define PWM1_OC4FE 0x04
#define PWM1_CC4S0 0x00
#define PWM1_CC4S1 0x01
#define PWM1_CC4S2 0x02
#define PWM1_CC4S3 0x03
#define PWM1_IC4F0 0x00
#define PWM1_IC4F1 0x01
#define PWM1_IC4F2 0x02
#define PWM1_IC4F3 0x03
#define PWM1_IC4F4 0x04
#define PWM1_IC4F5 0x05
#define PWM1_IC4F6 0x06
#define PWM1_IC4F7 0x07
#define PWM1_IC4F8 0x08
#define PWM1_IC4F9 0x09
#define PWM1_IC4F10 0x0a
#define PWM1_IC4F11 0x0b
#define PWM1_IC4F12 0x0c
#define PWM1_IC4F13 0x0d
#define PWM1_IC4F14 0x0e
#define PWM1_IC4F15 0x0f
#define PWM1_CCER1 (*(unsigned char volatile __xdata *)0xfecc)
#define PWM1_CC2NP 0x80
#define PWM1_CC2NE 0x40
#define PWM1_CC2P 0x20
#define PWM1_CC2E 0x10
#define PWM1_CC1NP 0x08
#define PWM1_CC1NE 0x04
#define PWM1_CC1P 0x02
#define PWM1_CC1E 0x01
#define PWM1_CCER2 (*(unsigned char volatile __xdata *)0xfecd)
#define PWM1_CC4NP 0x80
#define PWM1_CC4NE 0x40
#define PWM1_CC4P 0x20
#define PWM1_CC4E 0x10
#define PWM1_CC3NP 0x08
#define PWM1_CC3NE 0x04
#define PWM1_CC3P 0x02
#define PWM1_CC3E 0x01
#define PWM1_CNTR (*(unsigned int volatile __xdata *)0xfece)
#define PWM1_CNTRH (*(unsigned char volatile __xdata *)0xfece)
#define PWM1_CNTRL (*(unsigned char volatile __xdata *)0xfecf)
#define PWM1_PSCR (*(unsigned int volatile __xdata *)0xfed0)
#define PWM1_PSCRH (*(unsigned char volatile __xdata *)0xfed0)
#define PWM1_PSCRL (*(unsigned char volatile __xdata *)0xfed1)
#define PWM1_ARR (*(unsigned int volatile __xdata *)0xfed2)
#define PWM1_ARRH (*(unsigned char volatile __xdata *)0xfed2)
#define PWM1_ARRL (*(unsigned char volatile __xdata *)0xfed3)
#define PWM1_RCR (*(unsigned char volatile __xdata *)0xfed4)
#define PWM1_CCR1 (*(unsigned int volatile __xdata *)0xfed5)
#define PWM1_CCR1H (*(unsigned char volatile __xdata *)0xfed5)
#define PWM1_CCR1L (*(unsigned char volatile __xdata *)0xfed6)
#define PWM1_CCR2 (*(unsigned int volatile __xdata *)0xfed7)
#define PWM1_CCR2H (*(unsigned char volatile __xdata *)0xfed7)
#define PWM1_CCR2L (*(unsigned char volatile __xdata *)0xfed8)
#define PWM1_CCR3 (*(unsigned int volatile __xdata *)0xfed9)
#define PWM1_CCR3H (*(unsigned char volatile __xdata *)0xfed9)
#define PWM1_CCR3L (*(unsigned char volatile __xdata *)0xfeda)
#define PWM1_CCR4 (*(unsigned int volatile __xdata *)0xfedb)
#define PWM1_CCR4H (*(unsigned char volatile __xdata *)0xfedb)
#define PWM1_CCR4L (*(unsigned char volatile __xdata *)0xfedc)
#define PWM1_BKR (*(unsigned char volatile __xdata *)0xfedd)
#define PWM1_MOE 0x80
#define PWM1_AOE 0x40
#define PWM1_BKP 0x20
#define PWM1_BKE 0x10
#define PWM1_OSSR 0x08
#define PWM1_OSSI 0x04
#define PWM1_LOCK0 0x00
#define PWM1_LOCK1 0x01
#define PWM1_LOCK2 0x02
#define PWM1_LOCK3 0x03
#define PWM1_DTR (*(unsigned char volatile __xdata *)0xfede)
#define PWM1_OISR (*(unsigned char volatile __xdata *)0xfedf)
#define PWM1_OIS4N 0x80
#define PWM1_OIS4 0x40
#define PWM1_OIS3N 0x20
#define PWM1_OIS3 0x10
#define PWM1_OIS2N 0x08
#define PWM1_OIS2 0x04
#define PWM1_OIS1N 0x02
#define PWM1_OIS1 0x01
#define PWM2_CR1 (*(unsigned char volatile __xdata *)0xfee0)
#define PWM2_ARPE 0x80
#define PWM2_CMS0 0x00
#define PWM2_CMS1 0x20
#define PWM2_CMS2 0x40
#define PWM2_CMS3 0x60
#define PWM2_UP 0x00
#define PWM2_DOWN 0x10
#define PWM2_OPM 0x08
#define PWM2_URS 0x04
#define PWM2_UDIS 0x02
#define PWM2_CEN 0x01
#define PWM2_CR2 (*(unsigned char volatile __xdata *)0xfee1)
#define PWM2_TI2S 0x80
#define PWM2_MMS0 0x00
#define PWM2_MMS1 0x10
#define PWM2_MMS2 0x20
#define PWM2_MMS3 0x30
#define PWM2_MMS4 0x40
#define PWM2_MMS5 0x50
#define PWM2_MMS6 0x60
#define PWM2_MMS7 0x70
#define PWM2_COMS 0x04
#define PWM2_CCPS 0x01
#define PWM2_SMCR (*(unsigned char volatile __xdata *)0xfee2)
#define PWM2_MSM 0x80
#define PWM2_TS0 0x00
#define PWM2_TS1 0x10
#define PWM2_TS2 0x20
#define PWM2_TS3 0x30
#define PWM2_TS4 0x40
#define PWM2_TS5 0x50
#define PWM2_TS6 0x60
#define PWM2_TS7 0x70
#define PWM2_SMS0 0x00
#define PWM2_SMS1 0x01
#define PWM2_SMS2 0x02
#define PWM2_SMS3 0x03
#define PWM2_SMS4 0x04
#define PWM2_SMS5 0x05
#define PWM2_SMS6 0x06
#define PWM2_SMS7 0x07
#define PWM2_ETR (*(unsigned char volatile __xdata *)0xfee3)
#define PWM2_ETP 0x80
#define PWM2_ECE 0x40
#define PWM2_ETPS0 0x00
#define PWM2_ETPS1 0x10
#define PWM2_ETPS2 0x20
#define PWM2_ETPS3 0x30
#define PWM2_IER (*(unsigned char volatile __xdata *)0xfee4)
#define PWM2_BIE 0x80
#define PWM2_TIE 0x40
#define PWM2_COMIE 0x20
#define PWM2_CC8IE 0x10
#define PWM2_CC7IE 0x08
#define PWM2_CC6IE 0x04
#define PWM2_CC5IE 0x02
#define PWM2_UIE 0x01
#define PWM2_SR1 (*(unsigned char volatile __xdata *)0xfee5)
#define PWM2_BIF 0x80
#define PWM2_TIF 0x40
#define PWM2_COMIF 0x20
#define PWM2_CC8IF 0x10
#define PWM2_CC7IF 0x08
#define PWM2_CC6IF 0x04
#define PWM2_CC5IF 0x02
#define PWM2_UIF 0x01
#define PWM2_SR2 (*(unsigned char volatile __xdata *)0xfee6)
#define PWM2_CC8OF 0x10
#define PWM2_CC7OF 0x08
#define PWM2_CC6OF 0x04
#define PWM2_CC5OF 0x02
#define PWM2_EGR (*(unsigned char volatile __xdata *)0xfee7)
#define PWM2_BG 0x80
#define PWM2_TG 0x40
#define PWM2_COMG 0x20
#define PWM2_CC8G 0x10
#define PWM2_CC7G 0x08
#define PWM2_CC6G 0x04
#define PWM2_CC5G 0x02
#define PWM2_UG 0x01
#define PWM2_CCMR1 (*(unsigned char volatile __xdata *)0xfee8)
#define PWM2_OC5CE 0x80
#define PWM2_OC5M0 0x00
#define PWM2_OC5M1 0x10
#define PWM2_OC5M2 0x20
#define PWM2_OC5M3 0x30
#define PWM2_OC5M4 0x40
#define PWM2_OC5M5 0x50
#define PWM2_OC5M6 0x60
#define PWM2_OC5M7 0x70
#define PWM2_OC5PE 0x08
#define PWM2_OC5FE 0x04
#define PWM2_CC5S0 0x00
#define PWM2_CC5S1 0x01
#define PWM2_CC5S2 0x02
#define PWM2_CC5S3 0x03
#define PWM2_IC5F0 0x00
#define PWM2_IC5F1 0x01
#define PWM2_IC5F2 0x02
#define PWM2_IC5F3 0x03
#define PWM2_IC5F4 0x04
#define PWM2_IC5F5 0x05
#define PWM2_IC5F6 0x06
#define PWM2_IC5F7 0x07
#define PWM2_IC5F8 0x08
#define PWM2_IC5F9 0x09
#define PWM2_IC5F10 0x0a
#define PWM2_IC5F11 0x0b
#define PWM2_IC5F12 0x0c
#define PWM2_IC5F13 0x0d
#define PWM2_IC5F14 0x0e
#define PWM2_IC5F15 0x0f
#define PWM2_CCMR2 (*(unsigned char volatile __xdata *)0xfee9)
#define PWM2_OC6CE 0x80
#define PWM2_OC6M0 0x00
#define PWM2_OC6M1 0x10
#define PWM2_OC6M2 0x20
#define PWM2_OC6M3 0x30
#define PWM2_OC6M4 0x40
#define PWM2_OC6M5 0x50
#define PWM2_OC6M6 0x60
#define PWM2_OC6M7 0x70
#define PWM2_OC6PE 0x08
#define PWM2_OC6FE 0x04
#define PWM2_CC6S0 0x00
#define PWM2_CC6S1 0x01
#define PWM2_CC6S2 0x02
#define PWM2_CC6S3 0x03
#define PWM2_IC6F0 0x00
#define PWM2_IC6F1 0x01
#define PWM2_IC6F2 0x02
#define PWM2_IC6F3 0x03
#define PWM2_IC6F4 0x04
#define PWM2_IC6F5 0x05
#define PWM2_IC6F6 0x06
#define PWM2_IC6F7 0x07
#define PWM2_IC6F8 0x08
#define PWM2_IC6F9 0x09
#define PWM2_IC6F10 0x0a
#define PWM2_IC6F11 0x0b
#define PWM2_IC6F12 0x0c
#define PWM2_IC6F13 0x0d
#define PWM2_IC6F14 0x0e
#define PWM2_IC6F15 0x0f
#define PWM2_CCMR3 (*(unsigned char volatile __xdata *)0xfeea)
#define PWM2_OC7CE 0x80
#define PWM2_OC7M0 0x00
#define PWM2_OC7M1 0x10
#define PWM2_OC7M2 0x20
#define PWM2_OC7M3 0x30
#define PWM2_OC7M4 0x40
#define PWM2_OC7M5 0x50
#define PWM2_OC7M6 0x60
#define PWM2_OC7M7 0x70
#define PWM2_OC7PE 0x08
#define PWM2_OC7FE 0x04
#define PWM2_CC7S0 0x00
#define PWM2_CC7S1 0x01
#define PWM2_CC7S2 0x02
#define PWM2_CC7S3 0x03
#define PWM2_IC7F0 0x00
#define PWM2_IC7F1 0x01
#define PWM2_IC7F2 0x02
#define PWM2_IC7F3 0x03
#define PWM2_IC7F4 0x04
#define PWM2_IC7F5 0x05
#define PWM2_IC7F6 0x06
#define PWM2_IC7F7 0x07
#define PWM2_IC7F8 0x08
#define PWM2_IC7F9 0x09
#define PWM2_IC7F10 0x0a
#define PWM2_IC7F11 0x0b
#define PWM2_IC7F12 0x0c
#define PWM2_IC7F13 0x0d
#define PWM2_IC7F14 0x0e
#define PWM2_IC7F15 0x0f
#define PWM2_CCMR4 (*(unsigned char volatile __xdata *)0xfeeb)
#define PWM2_OC8CE 0x80
#define PWM2_OC8M0 0x00
#define PWM2_OC8M1 0x10
#define PWM2_OC8M2 0x20
#define PWM2_OC8M3 0x30
#define PWM2_OC8M4 0x40
#define PWM2_OC8M5 0x50
#define PWM2_OC8M6 0x60
#define PWM2_OC8M7 0x70
#define PWM2_OC8PE 0x08
#define PWM2_OC8FE 0x04
#define PWM2_CC8S0 0x00
#define PWM2_CC8S1 0x01
#define PWM2_CC8S2 0x02
#define PWM2_CC8S3 0x03
#define PWM2_IC8F0 0x00
#define PWM2_IC8F1 0x01
#define PWM2_IC8F2 0x02
#define PWM2_IC8F3 0x03
#define PWM2_IC8F4 0x04
#define PWM2_IC8F5 0x05
#define PWM2_IC8F6 0x06
#define PWM2_IC8F7 0x07
#define PWM2_IC8F8 0x08
#define PWM2_IC8F9 0x09
#define PWM2_IC8F10 0x0a
#define PWM2_IC8F11 0x0b
#define PWM2_IC8F12 0x0c
#define PWM2_IC8F13 0x0d
#define PWM2_IC8F14 0x0e
#define PWM2_IC8F15 0x0f
#define PWM2_CCER1 (*(unsigned char volatile __xdata *)0xfeec)
#define PWM2_CC6P 0x20
#define PWM2_CC6E 0x10
#define PWM2_CC5P 0x02
#define PWM2_CC5E 0x01
#define PWM2_CCER2 (*(unsigned char volatile __xdata *)0xfeed)
#define PWM2_CC8P 0x20
#define PWM2_CC8E 0x10
#define PWM2_CC7P 0x02
#define PWM2_CC7E 0x01
#define PWM2_CNTR (*(unsigned int volatile __xdata *)0xfeee)
#define PWM2_CNTRH (*(unsigned char volatile __xdata *)0xfeee)
#define PWM2_CNTRL (*(unsigned char volatile __xdata *)0xfeef)
#define PWM2_PSCR (*(unsigned int volatile __xdata *)0xfef0)
#define PWM2_PSCRH (*(unsigned char volatile __xdata *)0xfef0)
#define PWM2_PSCRL (*(unsigned char volatile __xdata *)0xfef1)
#define PWM2_ARR (*(unsigned int volatile __xdata *)0xfef2)
#define PWM2_ARRH (*(unsigned char volatile __xdata *)0xfef2)
#define PWM2_ARRL (*(unsigned char volatile __xdata *)0xfef3)
#define PWM2_RCR (*(unsigned char volatile __xdata *)0xfef4)
#define PWM2_CCR1 (*(unsigned int volatile __xdata *)0xfef5)
#define PWM2_CCR1H (*(unsigned char volatile __xdata *)0xfef5)
#define PWM2_CCR1L (*(unsigned char volatile __xdata *)0xfef6)
#define PWM2_CCR2 (*(unsigned int volatile __xdata *)0xfef7)
#define PWM2_CCR2H (*(unsigned char volatile __xdata *)0xfef7)
#define PWM2_CCR2L (*(unsigned char volatile __xdata *)0xfef8)
#define PWM2_CCR3 (*(unsigned int volatile __xdata *)0xfef9)
#define PWM2_CCR3H (*(unsigned char volatile __xdata *)0xfef9)
#define PWM2_CCR3L (*(unsigned char volatile __xdata *)0xfefa)
#define PWM2_CCR4 (*(unsigned int volatile __xdata *)0xfefb)
#define PWM2_CCR4H (*(unsigned char volatile __xdata *)0xfefb)
#define PWM2_CCR4L (*(unsigned char volatile __xdata *)0xfefc)
#define PWM2_BKR (*(unsigned char volatile __xdata *)0xfefd)
#define PWM2_MOE 0x80
#define PWM2_AOE 0x40
#define PWM2_BKP 0x20
#define PWM2_BKE 0x10
#define PWM2_OSSR 0x08
#define PWM2_OSSI 0x04
#define PWM2_LOCK0 0x00
#define PWM2_LOCK1 0x01
#define PWM2_LOCK2 0x02
#define PWM2_LOCK3 0x03
#define PWM2_DTR (*(unsigned char volatile __xdata *)0xfefe)
#define PWM2_OISR (*(unsigned char volatile __xdata *)0xfeff)
#define PWM2_OIS8 0x40
#define PWM2_OIS7 0x10
#define PWM2_OIS6 0x04
#define PWM2_OIS5 0x01

