cjacker/opensource-toolchain-8051/headers/stc12h.h
#define P0INTE (*(unsigned char volatile __xdata *)0xfd00)
#define P1INTE (*(unsigned char volatile __xdata *)0xfd01)
#define P2INTE (*(unsigned char volatile __xdata *)0xfd02)
#define P3INTE (*(unsigned char volatile __xdata *)0xfd03)
#define P4INTE (*(unsigned char volatile __xdata *)0xfd04)
#define P5INTE (*(unsigned char volatile __xdata *)0xfd05)
#define P6INTE (*(unsigned char volatile __xdata *)0xfd06)
#define P7INTE (*(unsigned char volatile __xdata *)0xfd07)
#define P0INTF (*(unsigned char volatile __xdata *)0xfd10)
#define P1INTF (*(unsigned char volatile __xdata *)0xfd11)
#define P2INTF (*(unsigned char volatile __xdata *)0xfd12)
#define P3INTF (*(unsigned char volatile __xdata *)0xfd13)
#define P4INTF (*(unsigned char volatile __xdata *)0xfd14)
#define P5INTF (*(unsigned char volatile __xdata *)0xfd15)
#define P6INTF (*(unsigned char volatile __xdata *)0xfd16)
#define P7INTF (*(unsigned char volatile __xdata *)0xfd17)
#define P0IM0 (*(unsigned char volatile __xdata *)0xfd20)
#define P1IM0 (*(unsigned char volatile __xdata *)0xfd21)
#define P2IM0 (*(unsigned char volatile __xdata *)0xfd22)
#define P3IM0 (*(unsigned char volatile __xdata *)0xfd23)
#define P4IM0 (*(unsigned char volatile __xdata *)0xfd24)
#define P5IM0 (*(unsigned char volatile __xdata *)0xfd25)
#define P6IM0 (*(unsigned char volatile __xdata *)0xfd26)
#define P7IM0 (*(unsigned char volatile __xdata *)0xfd27)
#define P0IM1 (*(unsigned char volatile __xdata *)0xfd30)
#define P1IM1 (*(unsigned char volatile __xdata *)0xfd31)
#define P2IM1 (*(unsigned char volatile __xdata *)0xfd32)
#define P3IM1 (*(unsigned char volatile __xdata *)0xfd33)
#define P4IM1 (*(unsigned char volatile __xdata *)0xfd34)
#define P5IM1 (*(unsigned char volatile __xdata *)0xfd35)
#define P6IM1 (*(unsigned char volatile __xdata *)0xfd36)
#define P7IM1 (*(unsigned char volatile __xdata *)0xfd37)

#define MD3 (*(unsigned char volatile __xdata *)0xfcf0)
#define MD2 (*(unsigned char volatile __xdata *)0xfcf1)
#define MD1 (*(unsigned char volatile __xdata *)0xfcf2)
#define MD0 (*(unsigned char volatile __xdata *)0xfcf3)
#define MD5 (*(unsigned char volatile __xdata *)0xfcf4)
#define MD4 (*(unsigned char volatile __xdata *)0xfcf5)
#define dwOP1 (*(unsigned long volatile __xdata *)0xfcf0)
#define wOP1 (*(unsigned int volatile __xdata *)0xfcf2)
#define wOP2 (*(unsigned int volatile __xdata *)0xfcf4)
#define ARCON (*(unsigned char volatile __xdata *)0xfcf6)
#define MDU16_OP_RSHIFT (1 << 5)
#define MDU16_OP_LSHIFT (2 << 5)
#define MDU16_OP_NORMALIZE (3 << 5)
#define MDU16_OP_16MUL16 (4 << 5)
#define MDU16_OP_16DIV16 (5 << 5)
#define MDU16_OP_32DIV16 (6 << 5)
#define OPCON (*(unsigned char volatile __xdata *)0xfcf7)
#define MDU16_START 0x01
#define MDU16_BUSY 0x01
#define MDU16_RESET 0x02

typedef struct TAG_PWM_STRUCT
{
    unsigned char CR1;
    unsigned char CR2;
    unsigned char SMCR;
    unsigned char ETR;
    unsigned char IER;
    unsigned char SR1;
    unsigned char SR2;
    unsigned char EGR;
    unsigned char CCMR1;
    unsigned char CCMR2;
    unsigned char CCMR3;
    unsigned char CCMR4;
    unsigned char CCER1;
    unsigned char CCER2;
    unsigned int CNTR;
    unsigned int PSCR;
    unsigned int ARR;
    unsigned char RCR;
    unsigned int CCR1;
    unsigned int CCR2;
    unsigned int CCR3;
    unsigned int CCR4;
    unsigned char BKR;
    unsigned char DTR;
    unsigned char OISR;
} PWM_STRUCT;

#define PWM1 ((PWM_STRUCT volatile __xdata *)0xfec0)
#define PWM2 ((PWM_STRUCT volatile __xdata *)0xfee0)

/////////////////////////////////////////////////

#define INT0_VECTOR 0//0003H
#define TMR0_VECTOR 1//000BH
#define INT1_VECTOR 2//0013H
#define TMR1_VECTOR 3//001BH
#define UART1_VECTOR 4//0023H
#define ADC_VECTOR 5//002BH
#define LVD_VECTOR 6//0033H
#define PCA_VECTOR 7//003BH
#define UART2_VECTOR 8//0043H
#define SPI_VECTOR 9//004BH
#define INT2_VECTOR 10//0053H
#define INT3_VECTOR 11//005BH
#define TMR2_VECTOR 12//0063H
#define INT4_VECTOR 16//0083H
#define UART3_VECTOR 17//008BH
#define UART4_VECTOR 18//0093H
#define TMR3_VECTOR 19//009BH
#define TMR4_VECTOR 20//00A3H
#define CMP_VECTOR 21//00ABH
#define I2C_VECTOR 24//00C3H
#define PWM1_VECTOR 26//00D3H
#define PWM2_VECTOR 27//00DBH
#define P0INT_VECTOR 37//011B
#define P1INT_VECTOR 38//0123
#define P2INT_VECTOR 39//012B
#define P3INT_VECTOR 40//0133
#define P4INT_VECTOR 41//013B
#define P5INT_VECTOR 42//0143
#define P6INT_VECTOR 43//014B
#define P7INT_VECTOR 44//0153
#define P8INT_VECTOR 45//015B
#define P9INT_VECTOR 46//0163

/////////////////////////////////////////////////

#endif

